In [ ]:
#1. 타이타닉 데이터셋
#2. 데이터는 총 몇건, 컬럼은 총 몇개?
#3. 결측치가 있는 컬럼은?
#4. pclass는 몇개로 구분되어 있는가.
#5. 남자/여자 각각 전체 평균 나이는
#6. Fare의 최솟값, 최댓값은 얼마?

In [2]:
import pandas as pd

In [4]:
titanic = pd.read_csv('C:/Users/jminw/titanic.csv')
t = pd.DataFrame(titanic) ; t    #1. 타이타닉 데이터셋

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [11]:
#2. 데이터는 총 몇건, 컬럼은 총 몇개?
t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [13]:
#3. 결측치가 있는 컬럼은?
null_count = t.isnull().sum() ; null_count

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [55]:
#4. pclass는 몇개로 구분되어 있는가.
t.iloc[:,2:3]
t.groupby('Pclass').count()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [56]:
t_Pclass = t.iloc[:,2:3]

In [57]:
t['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [ ]:
#5. 남자/여자 각각 전체 평균 나이는

In [58]:
t['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [59]:
t_age= t.groupby(['Sex']).mean()

In [60]:
t_age.iloc[:,3:4]

              Age
Sex
female  27.915709
male    30.726645

In [61]:
#6. Fare의 최솟값, 최댓값은 얼마?

In [62]:
t['Fare'].max()

512.3292

In [63]:
t['Fare'].min()

0.0